// Визначити число, яке отримане виписуванням 
// у зворотному порядку цифр заданого тризначного числа в десятковій системі числення.

#include <iostream> // бібліотека введення виведення 
#include <string>   // бібліотека для роботи з рядками

using namespace std; // стандартний простір імен

int main() // головна функція
{ // початок програми
    string FNAME = "Пушка"; // змінна з прізвищем
    int number; // змінна для збереження тризначного числа
    int result; // змінна для збереження результату

    cout << "Студент: " << FNAME << endl; // виведення прізвища 
    cout << "Ведіть тризначне число: "; // виведення підказки 
    cin >> number; // введення тризначного числа 

    int d1 = number / 100; // перша цифра
    int d2 = (number / 10) % 10; // друга цифра 
    int d3 = number % 10; // третя цифра

    result = d3 * 100 + d2 * 10 + d1; // число у зворотному порядку

    cout << "Результат: " << result << endl; // виведення результату

    return 0; // завершення програми
} // кінець програми