#include <iostream> //  бібліотека для введення та виведення інформації
#include <string>   //  бібліотека для роботи з текстовими рядками

using namespace std; // використання стандартного простору імен

int main() // головна функція програми
{ // початок програми
string studentLastName = "Пушка"; //змінна прізвищем

    float a, b, c; // оголошення трьох змінних для чисел
    float minVal;  // змінна для збереження мінімального значення

    cout << "Студент: " << studentLastName << endl; // виведення прізвища 
    cout << " Пошук мiнiмального значення серед  чисел " << endl; // виведення заголовка

    cout << "Введiть три числа (a, b, c): "; // підказка для користувача
    cin >> a >> b >> c; // введення трьох чисел з клавіатури

    minVal = a; // припускаємо, що перше число a є найменшим

    if (b < minVal) // перевіряємо, чи число b менше за поточний мінімум
    {
        minVal = b; // якщо b менше, оновлюємо мінімум
    }

    if (c < minVal) // перевіряємо, чи число c менше за поточний мінімум
    {
        minVal = c; // якщо c менше, оновлюємо мінімум
    }

    cout << "Мiнiмальне значення: " << minVal << endl; // виведення результату

    return 0; //  завершення програми
} // кінець програми