//Визначити кількість цифр у заданому цілому числі.

#include <iostream> // підключення бібліотеки для введення та виведення 
#include <cmath>    // підключення бібліотеки для математичної функції abs 

using namespace std; // використання стандартного простору імен

int main() { // головна функція програми
    cout << "Студент: Пушка" << endl; 

    long long number; // оголошення змінної для вхідного цілого числа
    cout << "Введіть ціле число: "; // виведення підказки для користувача
    cin >> number; // зчитування введеного числа з клавіатури

    long long temp = abs(number); // беремо модуль числа, щоб правильно працювати з від'ємними числами
    int count = 0; // зміна для збереження кількості цифр 

    // Перевірка введенняя числа 0
    if (temp == 0) { // перевірка, чи дорівнює число нулю
        count = 1; // число 0 складається з однієї цифри
    } // кінець if
    else { // else виконується, якщо число не дорівнює нулю
        while (temp > 0) { // цикл while виконується, поки в числі залишилися цифри
            temp = temp / 10; // відкидаємо останню цифру числа шляхом  ділення на 10
            count++; // збільшуємо лічильник кількості цифр на 1
        } // кінець while
    } // кінець else

    cout << "Кількість цифр у числі: " << count << endl; // виведення результату

    return 0; 
} 